In [1]:
import pandas as pd

In [3]:
data = {
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Furniture', 'Office Supplies', 'Office Supplies'],
    'Month': ['January', 'February', 'January', 'February', 'January', 'February'],
    'Sales': [200, 300, 150, 250, 100, 180],
    'Profit': [50, 70, 40, 60, 30, 50]
}

df = pd.DataFrame(data)
df

          Category     Month  Sales  Profit
0      Electronics   January    200      50
1      Electronics  February    300      70
2        Furniture   January    150      40
3        Furniture  February    250      60
4  Office Supplies   January    100      30
5  Office Supplies  February    180      50

In [6]:
p = df.pivot_table(index='Category', columns='Month', values=['Sales','Profit'], aggfunc='sum')
p

                  Profit            Sales
Month           February January February January
Category
Electronics           70      50      300     200
Furniture             60      40      250     150
Office Supplies       50      30      180     100